In [1]:
#Data.csv

# Step 1: Importing the libraries

In [2]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelBinarizer
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

# Step 2: Importing dataset

In [4]:
df=pd.read_csv("C://datasets//JERIN_GUVI//Data.csv")

In [8]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [9]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

# Step 3: Handling the missing data

In [11]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [13]:
df["Age"].fillna(df["Age"].mean(),inplace= True)
df["Salary"].fillna(df["Salary"].mean(),inplace=True)

print(df)

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

# Step 4: Encoding categorical data

In [14]:
dataframe=df.copy()

print(dataframe.Country.value_counts())

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [17]:
encoder=OneHotEncoder(handle_unknown='ignore')
lb=LabelBinarizer()
le=LabelEncoder()
dataframe["Country"]=le.fit_transform(dataframe["Country"])
dataframe["Purchased"]=lb.fit_transform(dataframe["Purchased"])

In [18]:
dataframe.head()

   Country   Age        Salary  Purchased
0        0  44.0  72000.000000          0
1        2  27.0  48000.000000          1
2        1  30.0  54000.000000          0
3        2  38.0  61000.000000          0
4        1  40.0  63777.777778          1

# Step 5: Creating a dummy variable

In [19]:
pd.get_dummies(df)

,Age,Salary,Country_France,Country_Germany,Country_Spain,Purchased_No,Purchased_Yes
0,44.000000,72000.000000,1,0,0,1,0
1,27.000000,48000.000000,0,0,1,0,1
2,30.000000,54000.000000,0,1,0,1,0
3,38.000000,61000.000000,0,0,1,1,0
4,40.000000,63777.777778,0,1,0,0,1
5,35.000000,58000.000000,1,0,0,0,1
6,38.777778,52000.000000,0,0,1,1,0
7,48.000000,79000.000000,1,0,0,0,1
8,50.000000,83000.000000,0,1,0,1,0
9,37.000000,67000.000000,1,0,0,0,1

# Step 6: Splitting the datasets into training sets and Test sets

In [26]:
x=dataframe.drop(["Country","Purchased"],axis=1)
y=dataframe.Purchased

# splitting the dataset into training set and test set
X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size=0.2, random_state=0)

# Step 7: Feature Scaling

In [27]:
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(xtest)

In [28]:
X_train

array([[ 0.26306757,  0.12381479],
       [-0.25350148,  0.46175632],
       [-1.97539832, -1.53093341],
       [ 0.05261351, -1.11141978],
       [ 1.64058505,  1.7202972 ],
       [-0.0813118 , -0.16751412],
       [ 0.95182631,  0.98614835],
       [-0.59788085, -0.48214934]])

In [29]:
X_test

array([[-1.45882927, -0.90166297],
       [-0.25350148,  0.46175632]])